clc;clear;clf;
%原始数据的定义
%X=-15:5:15;%两边为最大最小值，中间为刻度值需要和Y一样
%Y=-15:0.1:15;%两边为最大最小值，中间为刻度值需要和X一样
h=[0.154 0.154 0.178 0.141 0.141 0.155 0.145 0.143 0.160];
x=[0.0349 0.0000 -0.0404 0.0329 0.0000 -0.0361 0.0329 0.0000 -0.0363];
y=[-0.0359 -0.0359 -0.0415 0.0000 0.0000 0.0000 0.0338 0.0333 0.0373 ];
z=[0.1456 0.1456 0.1683 0.1333 0.1333 0.1465 0.1371 0.1352 0.1513];
%确定网格坐标（x和y方向的步长均取0.1）
[X,Y]=meshgrid(min(x):0.0001:max(x),min(y):0.0001:max(y));
%在网格点位置插值求Z，注意：不同的插值方法得到的曲线光滑度不同
Z=griddata(x,y,z,X,Y);
%绘制曲面
c=Z;
mesh(X,Y,Z);
%surf(X,Y,Z,c);
title 'Points to Surface by griddata'
hold on
plot3(x,y,z,'*')   
std2(z)

